mekops-labs/wanted-engine/platform/esp-idf/project/sdkconfig.defaults.esp32s3
# ESP32-S3R8 (octal PSRAM), ESP-IDF. Applied alongside the chip-independent
# sdkconfig.defaults (see Justfile).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# ESP-IDF native app-rollback: the bootloader boots a newly-committed OTA
# slot as PENDING_VERIFY and reverts to the previous slot if the app never
# confirms it (PlatformOtaConfirm, platform/esp-idf/ota.c) -- no MCUboot
# needed, this is the stock ESP-IDF bootloader's own A/B mechanism. Secure
# boot stays off (CONFIG_SECURE_BOOT unset): unsigned OTA images are
# accepted by design for now -- signed OTA
# is an explicit, separate follow-up.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Octal PSRAM with the flash/PSRAM coexistence mitigations validated in the
# coexistence reproducer (auto-suspend keeps the cache enabled during flash ops;
# XIP-from-PSRAM frees internal RAM for WiFi/TLS).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPI_FLASH_AUTO_SUSPEND=y

# Console over USB-Serial/JTAG (XIAO ESP32-S3).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
